public class data_types {
    public static void main(String[] args) {
//Типы данных (простые, примитивные)
//psvm - точка входа
        //sout - вывод текста на консоль
        //Тема: типы данных
        //Целочисленные т.д.
        byte b;//обьявили переменную с именем B
        b = 127;//присвоили значение
        // Byte - тип данных
        // b - название переменной
        // 127 - значение
// b = 127;//-128 до 127
        short sh = 32767;//
        //= - просвоить
        int i = 2_000_000_000;
        long l = 2_000_000_000_000_000_000L;

// Дробные (с плавающей точкой) Т.Д.
        double d = 3.15;//64bit
        float f = 3.15f;//32bit

        //Логический т.д.:
        boolean bool, bool2;
        bool = true;
        bool2 = false;

        //символьный т.д.
        char ch1 = '#', ch2 = 'p', ch3 = '9';
    }
}
